docs/state_machines/mmd/en/core/state_Cluster_access.mmd
stateDiagram-v2
  direction LR

  state "Opened" as opened
  state "Closed" as closed

  [*] --> opened
  opened --> closed : Close
  closed --> opened : reopen
